Autodesk.Revit.DB.Analysis.AnalysisDisplayStyleMarkerTextLabelType
Text label visualization types for Markers and Text settings of analysis display style.
Since:
2012
Since:
2012

Autodesk.Revit.DB.Analysis.AnalysisDisplayStyleMarkerTextLabelType.ShowPredefined
Show text markers only for points that have flag ValueAtPointFlags::DisplayText

Autodesk.Revit.DB.Analysis.AnalysisDisplayStyleMarkerTextLabelType.ShowNone
Don't show text markers

Autodesk.Revit.DB.Analysis.AnalysisDisplayStyleMarkerTextLabelType.ShowAll
Show text markers for each point